app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "days".* FROM "days"  WHERE "days"."user_id" = $1  ORDER BY "days"."id" DESC LIMIT 14  [["user_id", 1]]
---
  def steps
  	"in route"
  	@user = User.find(params[:user_id])
    @user.days.last(14)