app/views/users/show.html.erb

SELECT  "days".* FROM "days"  WHERE "days"."user_id" = $1  ORDER BY "days"."id" DESC LIMIT 1  [["user_id", 1]]
---
<div id="clock" data-id="<%= @user.id %>">
  <% if @user.days.last.display_total_lgl[0] == '+' %>