app/controllers/sessions_controller.rb

  def create
    auth_hash = request.env['omniauth.auth']

    access_token = auth_hash["credentials"]["token"]

    get_trends(access_token)

    @authorization = Authorization.where("uid = '#{auth_hash["uid"]}'").first

    if @authorization
      @user = User.find(@authorization.user_id)
      session[:id] = @user.id
      # if @user.day.last.date != @trends_response['data']['data'][-1][0]
      #   logic 2015 03 26.split('') = [2,0,1,5,0,3,2,6]

      # end

    else
      @user = User.create(:firstname => auth_hash["info"]["first_name"], :lastname => auth_hash["info"]["last_name"], :image => auth_hash["info"]["photo"], :age => @age, :weight_kgs => @weight, :height_meters => @height, :gender => @gender)
      Authorization.create(:provider => auth_hash["provider"], :uid => auth_hash["uid"],:access_token => auth_hash["credentials"]["token"], :refresh_token => auth_hash["credentials"]["refresh_token"], user_id: @user.id)


      @trends_response['data']['data'].each do |day_data|
        p steps = (day_data[1]['m_steps']).to_i
        user_activity = Activity.create(steps: steps)
        user_day = Day.create(user_id: @user.id, date: day_data[0], activity_id: user_activity.id)
---
SELECT  "authorizations".* FROM "authorizations"  WHERE (uid = 'DZKhP1GKIZJoh9WWNgaYDA')  ORDER BY "authorizations"."id" ASC LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "authorizations" ("access_token", "created_at", "provider", "refresh_token", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "users" ("age", "created_at", "firstname", "gender", "height_meters", "image", "lastname", "updated_at", "weight_kgs") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "activities" ("created_at", "steps", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-03-31 17:50:59.282364"], ["steps", 0], ["updated_at", "2015-03-31 17:50:59.282364"]]
INSERT INTO "days" ("activity_id", "created_at", "date", "life_expectancy", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["activity_id", 1], ["created_at", "2015-03-31 17:50:59.296414"], ["date", 20141222], ["life_expectancy", 79], ["updated_at", "2015-03-31 17:50:59.296414"], ["user_id", 1]]