app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
  	@user = User.find(params[:id])